# Напишіть програму, яка приймає від користувача рядок і підстроку,
# а потім визначає позицію (індекс) першого входження підстроки у рядок.
# Якщо підстрока не знайдена, програма повинна повідомити користувача про це.
# find
main_string = input("Введіть рядок: ")
substring = input("Введіть підстроку для пошуку: ")
index = main_string.find(substring)
if index != -1:
    print(f'Підстрока знайдена на позиції: {index}')
else:
    print(f'Підстрока не знайдена')


s = 'Some words'
print(s.rfind('o'))