"""
Метод: sub

Дано рядок символів.
Виключити з цього рядка групи символів між дужками [, ].
Самі дужки теж мають бути виключені.
"""
import re

string = "Виключити із цієї [рядки групи] символів, [розташовані між] дужками [, ]."
print(re.findall(r'\[.*?\]', string))

s_string = re.sub(r'\[.*?\]', '', string)  # позбуваємось з цього рядка групи символів між дужками [, ]
print(s_string)

s_string = re.sub(r'\[|\]', '', string)  # позбуваємось скобок [, ]
print(s_string)

s_string = re.sub(r'\[.*?\]', '[]', string)  # видаляємо вміст у скобках
print(s_string)